_orgs/2014-09-04-pythong_yield.org
#+BEGIN_EXPORT html
---
layout: post
title: Python yield
---
#+END_EXPORT
#+OPTIONS: ^:nil
* 说明
  原文：http://www.jeffknupp.com/blog/2013/04/07/improve-your-python-yield-and-generators-explained/

  原文的代码格式都用下划线替代了，打下划线把我的指头都打抽了.....
* 学习Python："yield"和Generator的解释
  在开新课程前，我都会让学生自我评估一下自己的对Python各概念的理解情况。一些内容（比如：if/else的控制流处理、函数的定义和使用）大部分学生在课程开始前都可以理解。但是，还是有一些内容几乎所有的学生都不理解或者理解有限。其中，"generators和yield"就是最大的问题之一，我估计这也是所有Python初学者的共同点。

  经常有人说，哪怕十分努力学习这个问题，还是不怎么理解。所以我来了，本文我就要解释下yield的作用、为何其有用以及如何使用它。

  注意：在最近这些年，PEP一直都在给generator增加特性，让它变的越来越强大。下篇文章，我会探索 _yield_ 与协程、协同多任务、异步IO结合后的强大（特别是这些在GvR[fn:1]的基础之一"[[https://code.google.com/p/tulip/][tulip]] "的原型实现中的使用）。当然，首先我们需要很好的理解 _yield_ 和 _generator_ 的工作原理。

** 协程和子程序
   当我们调用函数的时候，执行都是从函数的第一行开始，一直遇到 _return_ 、出现 _exception_ 或者到达函数的结尾（相当是一个隐式的 _return None_ ）。函数把控制权交给调用者后就彻底结束了。任何局部变量和函数的工作都会被丢弃。下一次新的调用又会重新开始。

   这个过程对计算机编程中的函数（或者任何[[http://en.wikipedia.org/wiki/Subroutine][子程序]] ）来说都是很标准的。如果能够定义一个特殊的函数：不像普通函数那样简单的就这么返回一个值而是可以产生一系列的值。有些情况下就会对编程有好处。要实现这个结果，就需要函数能够保存自己的状态。

   我之所以说”产生一系列的值“，因为我们假定中的这个函数不是像普通情况下的 *返回* 。 _return_ 意味着函数将控制流交回给调用自己的地方。而 *产生* ，意味着控制的转移是临时而自愿的，我们函数还希望后续能够再重新获得控制权。

   在Python里，这样的函数就被叫做 _generator_ ，而且十分有用。 _generator_ （还有 _yield_ ）的引入最初是为了让程序员可以有一个更加简单直接的方式来编写会产生一系列值的代码。之前，写一个随机数产生器需要引入一个类或者模块，这样才能实现生成多个值并且还能记录上次调用时的内部状态。有了 _generator_ ，这一问题变得很简单。
   
   为了更好的明白 _generator_ 解决的问题，举个例子。在这个例子里，请注意被解决的核心问题： *生成一系列的值* 。
   
   /注意：Python以外，除了最简单的 _generator_ ，其他的就都被称作 _协程_ 。这个词语我们后面再说。请注意，在Python里，本文有关 _协程_ 的说明都是指 _generator_ 。Python严格定义了 _generator_ ， _协程_ 虽然也在本文中出现了，但是在Python里没有严格定义。/

*** 例子：素数问题
    假设我们的老大要我们写一个函数：输入是 _int_ 的 _list_ ，返回的是一个包含这一列表中是素数的元素的Iterable。
    记住，[[http://docs.python.org/3/glossary.html#term-iterable][Iterable]] 就是一个可以一次返回一个成员的对象。
    ”没问题“，我们说完就搞定如下的代码：

#+BEGIN_SRC python
def get_primes(input_list):
    result_list = list()
    for element in input_list:
        if is_prime(element):
            result_list.append()

    return result_list

# or better yet...

def get_primes(input_list):
    return (element for element in input_list if is_prime(element))

# not germane to the example, but here's a possible implementation of
# is_prime...

def is_prime(number):
    if number > 1:
        if number == 2:
            return True
        if number % 2 == 0:
            return False
        for current in range(3, int(math.sqrt(number) + 1), 2):
            if number % current == 0: 
                return False
        return True
    return False
#+END_SRC
    上面的两个 _get_primes_ 都搞定了需求，于是就交活给老大了。老大也说没问题就是她想要的。

**** 处理无穷序列
     但是，世事难料。几天后，老大又来了，说遇到了个小问题：她想把这个函数用在一个非常大的列表上。而且，列表大到没法放入系统内存。为了解决这个问题，她希望能够给 _get_primes_ 一个 _start_ 值，然后获得所有比这个 _start_ 大的素数（说不定她就是在解决[[http://projecteuler.net/problem=10][欧拉问题10]]）。

     考虑下新需求，我们知道代码得大改了。显然，我们没法返回一个从 _start_ 值到无穷大的所有素数的列表（但是对无穷序列的操作却有很多应用需求）。使用传统函数解决这个问题的机会渺茫。

     放弃之前，我们需要看下到底是什么核心原因阻碍了我们写一个满足老大需求的函数。考虑一下，问题就是这个： *函数只有一次返回机会，而且必须一次性返回所有值* 。貌似这句话很废话。”函数不就是这么工作的么，“我们会想，但是如果我们能多问一句就能看到蹊跷了，”如果函数换个方式工作呢？“

     想象下如果 _get_primes_ 可以返回下一个值，而非一次性返回所有值。就不再需要构建一个列表了。没有列表，就没有内存问题了。由于我们老板就是把结果拿来迭代的，所以无所谓返回一个列表还是一个一个结果返回。
     
     可惜的是，这个方法貌似无法实现。就算我们假设有一个函数可以允许我们从 _n_ 一直循环到 _无穷大_ ，返回值的时候还是有问题。

#+BEGIN_SRC python
def get_primes(start):
    for element in magical_infinite_range(start):
        if is_prime(element):
            return element     
#+END_SRC
     假设get_primes如此被调用：
#+BEGIN_SRC python
def solve_number_10():
    # She *is* working on Project Euler #10, I knew it!
    total = 2
    for next_prime in get_primes(3):
        if next_prime < 2000000:
            total += next_prime
        else:
            print(total)
            return
#+END_SRC
     显然，在 _get_primes_ 函数里， _number=3_ 的时候，我们很快就会直接从第四行返回。相对直接的 _return_ ，就需要一种方法产生一个值，然后下次调用的时候再继续返回下一个值。

     函数就无法实现这一功能了。他们执行 _return_ 的时候，自己的工作就结束了。哪怕我们可以让函数再调用一次，也没法贯彻自己这样的想法："来吧宝贝，现在不像我们平时那样从头开始，咱们直接从第四行开始吧。"函数只有一个 _入口_ ：第一行。

