_orgs/2014-09-04-pythong_yield.org
** 进入Generator
   上面的这种问题是很常见的，所以Python里新加入了一个结构来解决这个问题： _generator_ 。 _Generator_ 不断的产生值。建立 _generator_ 也尽量依照 _generator函数_ 的概念，十分方便，我们会一起介绍。

   _Generator函数_ 如同普通的函数，但是当需要一个值的时候，它会利用 _yield_ 来产生，而不是直接 _return_ 。如果一个函数的 _def_ 代码里包括了 _yield_ ，函数就自动成为了一个 _generator函数_ （即使同时还包含 _return_ ）, 不需要其他的额外工作。

   _generator函数_ 创建的是 _generator迭代器_ 。 _generator迭代器_ 这个名字从此你就不会再看到了，因为这个名字几乎就是 _generator_ 的别名。记住 _generator_ 就是一种特殊形式的 _迭代器_ 。作为 _迭代器_ ， _generator_ 必须定义一些方法，其中之一就是 __next__(). 。为了获得 _generator_ 中的下一个值，我们需要使用操作 _迭代器_ 的内置函数: _next()_ 。
   
   再说明白点： *为了从 _generator_ 获得下个值，我们使用 _next()_ 这个内置函数，而这个函数也是用来操作 _迭代器_ 的* 。（ _next()_ 负责调用 _generator_ 中的__next__()方法）。由于 _generator_ 是 _迭代器_ 的一种，所以是可以直接用在 _for_ 循环上的。

   所以当 _next()_ 调用 _generator_ 的时候， _generator_ 负责返回一个值给任何调用 _next()_ 的方法。具体的方法就是利用 _yield_ 来将值传回去(比如， _yield 7_)。最容易记忆的方法就是认为 _yield_ 是 _generator函数_ 的 _return_ 语句（只是稍微有点奇妙的不同）。
   同样，我们再说明白点： *_yeild_ 就是 _generator函数_ 的 _return_ 语句（稍微有点奇妙的不同）* 。
   来看看一个简单的 _generator函数_ ：
#+BEGIN_SRC python
>>> def simple_generator_function():
>>>    yield 1
>>>    yield 2
>>>    yield 3
#+END_SRC
   还有调用它的两种方法：
#+BEGIN_SRC python
>>> for value in simple_generator_function():
>>>     print(value)
1
2
3
>>> our_generator = simple_generator_function()
>>> next(our_generator)
1
>>> next(our_generator)
2
>>> next(our_generator)
3
#+END_SRC
   
*** 奇妙的部分?
    哪里是奇妙的部分呢？就等着你问这个问题，蛤蛤。 _generator函数_ 调用 _yield_ 的时候，函数的状态会被冻结；所有变量的状态都会保存下来，需要执行的下一行代码会被记录下来等待 _next()_ 的下次调用。待到调用时， _generator函数_ 又会回复如之前保存的状态。如果 _next()_ 从此不再调用，保存的状态最终都会被丢弃。
    我们现在就可以重写 _get_primes_ 成一个 _generator函数_ 了。注意，我们不再需要 _magical_infinite_range_ 函数了。使用简单的 _while_ 循环，我们就可以建立自己的无穷序列了：
    #+BEGIN_SRC python
def get_primes(number):
    while True:
        if is_prime(number):
            yield number
        number += 1
    #+END_SRC
    如果 _generator函数_ 执行 _return_ 或者到达定义结尾的时候，会产生一个 _StopIteration_ 异常。这个信号意味着 _generator_ 的值都已经产生完了（这也是 _迭代器_ 的正常行为）。这也是为什么在 _get_primes_ 里面有个 _while True:_ 死循环。如果没有的话，第一次调用 _next()_ 的时候我们还可以检查这个数字是否是素数，然后用 _yield_ 传出来。下一次调用的时候，我们会将 _number_ 加1,然后就到达了函数的结尾（此时就会产生 _StopIteration_ ）。一旦 _generator_ 用尽了，下一次再调用 _next()_ 就会产生错误，所以你只能获得所有的 _generator_ 的值一次。下面的代码就没法正常工作：
    #+BEGIN_SRC python
>>> our_generator = simple_generator_function()
>>> for value in our_generator:
>>>     print(value)

>>> # our_generator has been exhausted...
>>> print(next(our_generator))
Traceback (most recent call last):
  File "<ipython-input-13-7e48a609051a>", line 1, in <module>
    next(our_generator)
StopIteration

>>> # however, we can always create a new generator
>>> # by calling the generator function again...

>>> new_generator = simple_generator_function()
>>> print(next(new_generator)) # perfectly valid
1
    #+END_SRC
    所以这里的 _while_ 循环就是保证我们永远不会到达 _get_prime_ 函数的结尾。这样我们就可以让 _next()_ 调用 _generator_ 的时候一直输出。这也是处理无穷序列的一般方法（也是 _generator_ 的常用方法）。

*** 看看程序的控制流
    我们回到调用 _get_primes_ 的代码： _solve_number_10_ 。
#+BEGIN_SRC python
def solve_number_10():
    # She *is* working on Project Euler #10, I knew it!
    total = 2
    for next_prime in get_primes(3):
        if next_prime < 2000000:
            total += next_prime
        else:
            print(total)
            return
#+END_SRC
    看看我们在 _solve_number_10_ 函数 _for_ 循环里调用 _get_primes_ 时前面几个元素是如何产生的，这样也有助于我们更好的理解程序的流程。当 _for_ 循环向 _get_primes_ 请求第一个值的时候，我们就像普通函数一样的进入到 _get_primes_ 里。
    1. 我们在第三行进入 _while_ 循环
    2. 恰好 _if_ 条件符合(3是素数)
    3. 我们就产生值3，同时将控制流交回给 _solve_number_10_

    然后我们回到 _solve_number_10_ :

    1. 3被传回到了 _for_ 循环中
    2. _for_ 循环把值赋给了 _next_prime_
    3. _next_prime_ 被加到了 _total_ 上
    4. _for_ 循环从 _get_primes_ 获得下一个值

    这次，我们不是从 _get_primes_ 的最开始重新开始，而是直接从之前停下来的 _第五行_ 继续。

#+BEGIN_SRC python
def get_primes(number):
    while True:
        if is_prime(number):
            yield number
        number += 1 # <<<<<<<<<<
#+END_SRC
    更重要的是， /_number_ 还是保持我们之前调用 _yield_ 时的值（也就是3）/ 。我们说过， _yield_ 不仅仅是返回值给调用 _next()_ 的方法，而且还会保存 _generator函数_ 中的状态。显然，之后 _number_ 就会增加到4,我们又到达 _while_ 循环的开始，继续增加 _number_ 直到我们到达下一个素数(5)。然后我们再一次的 _yield_ ，将值传出到 _solve_number_10_ 的 _for_ 循环里。如此循环一直持续下去，直到 _for_ 循环结束(代码中就是第一个大于2000000的素数)。

