_posts/2014-09-04-pythong_yield.html
<div id="outline-container-orgd4a65d2" class="outline-3">
<h3 id="orgd4a65d2"><span class="section-number-3">2.2.</span> 进入Generator</h3>
<div class="outline-text-3" id="text-2-2">
<p>
上面的这种问题是很常见的，所以Python里新加入了一个结构来解决这个问题： <span class="underline">generator</span> 。 <span class="underline">Generator</span> 不断的产生值。建立 <span class="underline">generator</span> 也尽量依照 <span class="underline">generator函数</span> 的概念，十分方便，我们会一起介绍。
</p>

<p>
<span class="underline">Generator函数</span> 如同普通的函数，但是当需要一个值的时候，它会利用 <span class="underline">yield</span> 来产生，而不是直接 <span class="underline">return</span> 。如果一个函数的 <span class="underline">def</span> 代码里包括了 <span class="underline">yield</span> ，函数就自动成为了一个 <span class="underline">generator函数</span> （即使同时还包含 <span class="underline">return</span> ）, 不需要其他的额外工作。
</p>

<p>
<span class="underline">generator函数</span> 创建的是 <span class="underline">generator迭代器</span> 。 <span class="underline">generator迭代器</span> 这个名字从此你就不会再看到了，因为这个名字几乎就是 <span class="underline">generator</span> 的别名。记住 <span class="underline">generator</span> 就是一种特殊形式的 <span class="underline">迭代器</span> 。作为 <span class="underline">迭代器</span> ， <span class="underline">generator</span> 必须定义一些方法，其中之一就是 <span class="underline">_next__(). 。为了获得 _generator</span> 中的下一个值，我们需要使用操作 <span class="underline">迭代器</span> 的内置函数: <span class="underline">next()</span> 。
</p>

<p>
再说明白点： <b>为了从 <span class="underline">generator</span> 获得下个值，我们使用 <span class="underline">next()</span> 这个内置函数，而这个函数也是用来操作 <span class="underline">迭代器</span> 的</b> 。（ <span class="underline">next()</span> 负责调用 <span class="underline">generator</span> 中的__next__()方法）。由于 <span class="underline">generator</span> 是 <span class="underline">迭代器</span> 的一种，所以是可以直接用在 <span class="underline">for</span> 循环上的。
</p>

<p>
所以当 <span class="underline">next()</span> 调用 <span class="underline">generator</span> 的时候， <span class="underline">generator</span> 负责返回一个值给任何调用 <span class="underline">next()</span> 的方法。具体的方法就是利用 <span class="underline">yield</span> 来将值传回去(比如， <span class="underline">yield 7</span>)。最容易记忆的方法就是认为 <span class="underline">yield</span> 是 <span class="underline">generator函数</span> 的 <span class="underline">return</span> 语句（只是稍微有点奇妙的不同）。
同样，我们再说明白点： <b><span class="underline">yeild</span> 就是 <span class="underline">generator函数</span> 的 <span class="underline">return</span> 语句（稍微有点奇妙的不同）</b> 。
来看看一个简单的 <span class="underline">generator函数</span> ：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-operator">&gt;&gt;&gt;</span> <span class="org-keyword">def</span> <span class="org-function-name">simple_generator_function</span>():
<span class="org-operator">&gt;&gt;&gt;</span>    <span class="org-keyword">yield</span> 1
<span class="org-operator">&gt;&gt;&gt;</span>    <span class="org-keyword">yield</span> 2
<span class="org-operator">&gt;&gt;&gt;</span>    <span class="org-keyword">yield</span> 3
</pre>
</div>
<p>
还有调用它的两种方法：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-operator">&gt;&gt;&gt;</span> <span class="org-keyword">for</span> value <span class="org-keyword">in</span> simple_generator_function():
<span class="org-operator">&gt;&gt;&gt;</span>     <span class="org-builtin">print</span>(value)
1
2
3
<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-variable-name">our_generator</span> <span class="org-operator">=</span> simple_generator_function()
<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-builtin">next</span>(our_generator)
1
<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-builtin">next</span>(our_generator)
2
<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-builtin">next</span>(our_generator)
3
</pre>
</div>
</div>
<div id="outline-container-org15ad097" class="outline-4">
<h4 id="org15ad097"><span class="section-number-4">2.2.1.</span> 奇妙的部分?</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
哪里是奇妙的部分呢？就等着你问这个问题，蛤蛤。 <span class="underline">generator函数</span> 调用 <span class="underline">yield</span> 的时候，函数的状态会被冻结；所有变量的状态都会保存下来，需要执行的下一行代码会被记录下来等待 <span class="underline">next()</span> 的下次调用。待到调用时， <span class="underline">generator函数</span> 又会回复如之前保存的状态。如果 <span class="underline">next()</span> 从此不再调用，保存的状态最终都会被丢弃。
我们现在就可以重写 <span class="underline">get_primes</span> 成一个 <span class="underline">generator函数</span> 了。注意，我们不再需要 <span class="underline">magical_infinite_range</span> 函数了。使用简单的 <span class="underline">while</span> 循环，我们就可以建立自己的无穷序列了：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">get_primes</span>(number):
    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-keyword">if</span> is_prime(number):
            <span class="org-keyword">yield</span> number
        <span class="org-variable-name">number</span> <span class="org-operator">+=</span> 1
</pre>
</div>
<p>
如果 <span class="underline">generator函数</span> 执行 <span class="underline">return</span> 或者到达定义结尾的时候，会产生一个 <span class="underline">StopIteration</span> 异常。这个信号意味着 <span class="underline">generator</span> 的值都已经产生完了（这也是 <span class="underline">迭代器</span> 的正常行为）。这也是为什么在 <span class="underline">get_primes</span> 里面有个 <span class="underline">while True:</span> 死循环。如果没有的话，第一次调用 <span class="underline">next()</span> 的时候我们还可以检查这个数字是否是素数，然后用 <span class="underline">yield</span> 传出来。下一次调用的时候，我们会将 <span class="underline">number</span> 加1,然后就到达了函数的结尾（此时就会产生 <span class="underline">StopIteration</span> ）。一旦 <span class="underline">generator</span> 用尽了，下一次再调用 <span class="underline">next()</span> 就会产生错误，所以你只能获得所有的 <span class="underline">generator</span> 的值一次。下面的代码就没法正常工作：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-operator">&gt;&gt;&gt;</span> <span class="org-variable-name">our_generator</span> <span class="org-operator">=</span> simple_generator_function()
<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-keyword">for</span> value <span class="org-keyword">in</span> our_generator:
<span class="org-operator">&gt;&gt;&gt;</span>     <span class="org-builtin">print</span>(value)

<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-comment-delimiter"># </span><span class="org-comment">our_generator has been exhausted...
</span><span class="org-operator">&gt;&gt;&gt;</span> <span class="org-builtin">print</span>(<span class="org-builtin">next</span>(our_generator))
Traceback (most recent call last):
  File <span class="org-string">"&lt;ipython-input-13-7e48a609051a&gt;"</span>, line 1, <span class="org-keyword">in</span> <span class="org-operator">&lt;</span>module<span class="org-operator">&gt;</span>
    <span class="org-builtin">next</span>(our_generator)
<span class="org-type">StopIteration</span>

<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-comment-delimiter"># </span><span class="org-comment">however, we can always create a new generator
</span><span class="org-operator">&gt;&gt;&gt;</span> <span class="org-comment-delimiter"># </span><span class="org-comment">by calling the generator function again...
</span>
<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-variable-name">new_generator</span> <span class="org-operator">=</span> simple_generator_function()
<span class="org-operator">&gt;&gt;&gt;</span> <span class="org-builtin">print</span>(<span class="org-builtin">next</span>(new_generator)) <span class="org-comment-delimiter"># </span><span class="org-comment">perfectly valid
</span>1
</pre>
</div>
<p>
所以这里的 <span class="underline">while</span> 循环就是保证我们永远不会到达 <span class="underline">get_prime</span> 函数的结尾。这样我们就可以让 <span class="underline">next()</span> 调用 <span class="underline">generator</span> 的时候一直输出。这也是处理无穷序列的一般方法（也是 <span class="underline">generator</span> 的常用方法）。
</p>
</div>
</div>
<div id="outline-container-org1f8a4da" class="outline-4">
<h4 id="org1f8a4da"><span class="section-number-4">2.2.2.</span> 看看程序的控制流</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
我们回到调用 <span class="underline">get_primes</span> 的代码： <span class="underline">solve_number_10</span> 。
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">solve_number_10</span>():
    <span class="org-comment-delimiter"># </span><span class="org-comment">She *is* working on Project Euler #10, I knew it!
</span>    <span class="org-variable-name">total</span> <span class="org-operator">=</span> 2
    <span class="org-keyword">for</span> next_prime <span class="org-keyword">in</span> get_primes(3):
        <span class="org-keyword">if</span> next_prime <span class="org-operator">&lt;</span> 2000000:
            <span class="org-variable-name">total</span> <span class="org-operator">+=</span> next_prime
        <span class="org-keyword">else</span>:
            <span class="org-builtin">print</span>(total)
            <span class="org-keyword">return</span>
</pre>
</div>
<p>
看看我们在 <span class="underline">solve_number_10</span> 函数 <span class="underline">for</span> 循环里调用 <span class="underline">get_primes</span> 时前面几个元素是如何产生的，这样也有助于我们更好的理解程序的流程。当 <span class="underline">for</span> 循环向 <span class="underline">get_primes</span> 请求第一个值的时候，我们就像普通函数一样的进入到 <span class="underline">get_primes</span> 里。
</p>
<ol class="org-ol">
<li>我们在第三行进入 <span class="underline">while</span> 循环</li>
<li>恰好 <span class="underline">if</span> 条件符合(3是素数)</li>
<li>我们就产生值3，同时将控制流交回给 <span class="underline">solve_number_10</span></li>
</ol>

<p>
然后我们回到 <span class="underline">solve_number_10</span> :
</p>

<ol class="org-ol">
<li>3被传回到了 <span class="underline">for</span> 循环中</li>
<li><span class="underline">for</span> 循环把值赋给了 <span class="underline">next_prime</span></li>
<li><span class="underline">next_prime</span> 被加到了 <span class="underline">total</span> 上</li>
<li><span class="underline">for</span> 循环从 <span class="underline">get_primes</span> 获得下一个值</li>
</ol>

<p>
这次，我们不是从 <span class="underline">get_primes</span> 的最开始重新开始，而是直接从之前停下来的 <span class="underline">第五行</span> 继续。
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">get_primes</span>(number):
    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-keyword">if</span> is_prime(number):
            <span class="org-keyword">yield</span> number
        <span class="org-variable-name">number</span> <span class="org-operator">+=</span> 1 <span class="org-comment-delimiter"># </span><span class="org-comment">&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;</span>
</pre>
</div>
<p>
更重要的是， <i><span class="underline">number</span> 还是保持我们之前调用 <span class="underline">yield</span> 时的值（也就是3）</i> 。我们说过， <span class="underline">yield</span> 不仅仅是返回值给调用 <span class="underline">next()</span> 的方法，而且还会保存 <span class="underline">generator函数</span> 中的状态。显然，之后 <span class="underline">number</span> 就会增加到4,我们又到达 <span class="underline">while</span> 循环的开始，继续增加 <span class="underline">number</span> 直到我们到达下一个素数(5)。然后我们再一次的 <span class="underline">yield</span> ，将值传出到 <span class="underline">solve_number_10</span> 的 <span class="underline">for</span> 循环里。如此循环一直持续下去，直到 <span class="underline">for</span> 循环结束(代码中就是第一个大于2000000的素数)。
</p>
</div>
</div>
</div>
