_orgs/2014-09-04-pythong_yield.org
** 更加强大的功能
   在[[http://www.python.org/dev/peps/pep-0342/][PEP342]] 中，还进一步的加入了将值传入到 _generator_ 的支持。[[http://www.python.org/dev/peps/pep-0342/][PEP342]] 让 _generator_ 可以产生值（之前就可以），接受值，或者在一个语句中同时产生和接受(不同)值。
   为了说明如何将值传给 _generator_ ，我们回到素数例子上。这次，不是简单的依次返回比 _number_ 大的数字，我们要找到比一个连续的幂大的最小的素数（假设是10,我们就需要找到比10大的最小素数，然后是100，然后是1000，等等）。我们同样从 _get_primes_ 开始：
   #+BEGIN_SRC python
def print_successive_primes(iterations, base=10):
    # like normal functions, a generator function
    # can be assigned to a variable

    prime_generator = get_primes(base)
    # missing code...
    for power in range(iterations):
        # missing code...

def get_primes(number):
    while True:
        if is_prime(number):
        # ... what goes here?
   #+END_SRC
   _get_primes_ 的下一行需要说明下， _yield number_ 会将 _number_ 的值传出， _other = yield foo_ 的形式则是， _yield foo_ ，同时如果有值传入给我，则将 _other_ 设置为这个值。你可以通过 _generator_ 的 _send_ 方法传入值。
   #+BEGIN_SRC python
def get_primes(number):
    while True:
        if is_prime(number):
            number = yield number
        number += 1
   #+END_SRC
   这样，我们就是在每次 _generator_ 产生值的时候将 _number_ 设置为另外一个值。完整的代码如下：
#+BEGIN_SRC python
def print_successive_primes(iterations, base=10):
    prime_generator = get_primes(base)
    prime_generator.send(None)
    for power in range(iterations):
        print(prime_generator.send(base ** power))
#+END_SRC
   记住两件事：第一，我们可以打印 _generator.send_ 的返回值，因为 _send_ 函数在传值给 _generator_ 的同时也返回了 _generator_ 产生的值(和 _yield_ 在 _generator 函数_ 中的表现类似)。
   
   第二，注意 _prime_generator.send(None)_ 这行。当使用 _send_ 去启动一个 _generator_ 时（也就是从 _generator_ 的第一行一直执行到第一次遇到 _yield_ ），需要传一次 _None_ 。这是因为定义 _generator_ 的时候代码还没有运行到第一个 _yield_ ，所以如果我们这时候发送一个值就没有语句接收到这个值。等到 _generator_ 启动后，就可以像上面那样直接发送值了。

** 复习与总结
   在这个系列的下半场，我们会讨论各种加强 _generator_ 的方法，还有这些方法带来的强大能力。 _yield_ 也成为Python里最强大的关键字。现在我们对 _yield_ 的工作原理已经有了很好的理解，我们现在已经可以理解更多 _yield_ 的古怪用法。
   信不信由你，我们其实也只是了解了 _yield_ 强大能力的皮毛。比如，像上面那样利用 _send_ 传递值的方法，一般都不会用在我们例子里面这么简单的序列上。下面，我们贴了一段传递值的常用方法。我不会再说明这段代码具体如何工作及其工作原理，你们就当是第二部分的热身吧。
   #+BEGIN_SRC python
import random

def get_data():
    """Return 3 random integers between 0 and 9"""
    return random.sample(range(10), 3)

def consume():
    """Displays a running average across lists of integers sent to it"""
    running_sum = 0
    data_items_seen = 0

    while True:
        data = yield
        data_items_seen += len(data)
        running_sum += sum(data)
        print('The running average is {}'.format(running_sum / float(data_items_seen)))

def produce(consumer):
    """Produces a set of values and forwards them to the pre-defined consumer
    function"""
    while True:
        data = get_data()
        print('Produced {}'.format(data))
        consumer.send(data)
        yield

if __name__ == '__main__':
    consumer = consume()
    consumer.send(None)
    producer = produce(consumer)

    for _ in range(10):
        print('Producing...')
        next(producer)
   #+END_SRC
*** 重点
    在这个文章里面请记得这些重点：

    + _generators_ 用来产生一系列的值
    + _yield_ 就像 _generator函数_ 的 _return_
    + _yield_ 唯一的不同就是会保存 _generator函数_ 的状态
    + _generator_ 只是一种特殊的 _iterator_
    + 如同 _iterator_ ，我们可以通过调用 _next()_ 获得 _generator_ 的下一个值
      + _for_ 会隐式的调用 _next()_

      
    希望这篇文章能有所助益。如果你从没听说过 _generator_ ，希望你能够明白他是什么、为什么有用还有如何使用。如果你已经熟悉了 _generator_ ，希望这篇文章能为你解惑。
    老样子，任何部分不清楚的（或者存在错误的），请不吝指教。你可以在下面留言，或者邮件给我jeff@jeffknupp.com， 或者twitter上找我[[http://www.twitter.com/jeffknupp][@jeffknupp]]。

* Footnotes

[fn:1] 目测应该是这个http://gvr.sourceforge.net/index.php

