_posts/2014-09-04-pythong_yield.html
<div id="outline-container-orgd9ab474" class="outline-3">
<h3 id="orgd9ab474"><span class="section-number-3">2.3.</span> 更加强大的功能</h3>
<div class="outline-text-3" id="text-2-3">
<p>
在<a href="http://www.python.org/dev/peps/pep-0342/">PEP342</a> 中，还进一步的加入了将值传入到 <span class="underline">generator</span> 的支持。<a href="http://www.python.org/dev/peps/pep-0342/">PEP342</a> 让 <span class="underline">generator</span> 可以产生值（之前就可以），接受值，或者在一个语句中同时产生和接受(不同)值。
为了说明如何将值传给 <span class="underline">generator</span> ，我们回到素数例子上。这次，不是简单的依次返回比 <span class="underline">number</span> 大的数字，我们要找到比一个连续的幂大的最小的素数（假设是10,我们就需要找到比10大的最小素数，然后是100，然后是1000，等等）。我们同样从 <span class="underline">get_primes</span> 开始：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">print_successive_primes</span>(iterations, base<span class="org-operator">=</span>10):
    <span class="org-comment-delimiter"># </span><span class="org-comment">like normal functions, a generator function
</span>    <span class="org-comment-delimiter"># </span><span class="org-comment">can be assigned to a variable
</span>
    <span class="org-variable-name">prime_generator</span> <span class="org-operator">=</span> get_primes(base)
    <span class="org-comment-delimiter"># </span><span class="org-comment">missing code...
</span>    <span class="org-keyword">for</span> power <span class="org-keyword">in</span> <span class="org-builtin">range</span>(iterations):
        <span class="org-comment-delimiter"># </span><span class="org-comment">missing code...
</span>
<span class="org-keyword">def</span> <span class="org-function-name">get_primes</span>(number):
    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-keyword">if</span> is_prime(number):
        <span class="org-comment-delimiter"># </span><span class="org-comment">... what goes here?</span>
</pre>
</div>
<p>
<span class="underline">get_primes</span> 的下一行需要说明下， <span class="underline">yield number</span> 会将 <span class="underline">number</span> 的值传出， <span class="underline">other = yield foo</span> 的形式则是， <span class="underline">yield foo</span> ，同时如果有值传入给我，则将 <span class="underline">other</span> 设置为这个值。你可以通过 <span class="underline">generator</span> 的 <span class="underline">send</span> 方法传入值。
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">get_primes</span>(number):
    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-keyword">if</span> is_prime(number):
            <span class="org-variable-name">number</span> <span class="org-operator">=</span> <span class="org-keyword">yield</span> number
        <span class="org-variable-name">number</span> <span class="org-operator">+=</span> 1
</pre>
</div>
<p>
这样，我们就是在每次 <span class="underline">generator</span> 产生值的时候将 <span class="underline">number</span> 设置为另外一个值。完整的代码如下：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">print_successive_primes</span>(iterations, base<span class="org-operator">=</span>10):
    <span class="org-variable-name">prime_generator</span> <span class="org-operator">=</span> get_primes(base)
    prime_generator.send(<span class="org-constant">None</span>)
    <span class="org-keyword">for</span> power <span class="org-keyword">in</span> <span class="org-builtin">range</span>(iterations):
        <span class="org-builtin">print</span>(prime_generator.send(base <span class="org-operator">**</span> power))
</pre>
</div>
<p>
记住两件事：第一，我们可以打印 <span class="underline">generator.send</span> 的返回值，因为 <span class="underline">send</span> 函数在传值给 <span class="underline">generator</span> 的同时也返回了 <span class="underline">generator</span> 产生的值(和 <span class="underline">yield</span> 在 <span class="underline">generator 函数</span> 中的表现类似)。
</p>

<p>
第二，注意 <span class="underline">prime_generator.send(None)</span> 这行。当使用 <span class="underline">send</span> 去启动一个 <span class="underline">generator</span> 时（也就是从 <span class="underline">generator</span> 的第一行一直执行到第一次遇到 <span class="underline">yield</span> ），需要传一次 <span class="underline">None</span> 。这是因为定义 <span class="underline">generator</span> 的时候代码还没有运行到第一个 <span class="underline">yield</span> ，所以如果我们这时候发送一个值就没有语句接收到这个值。等到 <span class="underline">generator</span> 启动后，就可以像上面那样直接发送值了。
</p>
</div>
</div>
<div id="outline-container-org191f7cc" class="outline-3">
<h3 id="org191f7cc"><span class="section-number-3">2.4.</span> 复习与总结</h3>
<div class="outline-text-3" id="text-2-4">
<p>
在这个系列的下半场，我们会讨论各种加强 <span class="underline">generator</span> 的方法，还有这些方法带来的强大能力。 <span class="underline">yield</span> 也成为Python里最强大的关键字。现在我们对 <span class="underline">yield</span> 的工作原理已经有了很好的理解，我们现在已经可以理解更多 <span class="underline">yield</span> 的古怪用法。
信不信由你，我们其实也只是了解了 <span class="underline">yield</span> 强大能力的皮毛。比如，像上面那样利用 <span class="underline">send</span> 传递值的方法，一般都不会用在我们例子里面这么简单的序列上。下面，我们贴了一段传递值的常用方法。我不会再说明这段代码具体如何工作及其工作原理，你们就当是第二部分的热身吧。
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> random

<span class="org-keyword">def</span> <span class="org-function-name">get_data</span>():
    <span class="org-doc">"""Return 3 random integers between 0 and 9"""</span>
    <span class="org-keyword">return</span> random.sample(<span class="org-builtin">range</span>(10), 3)

<span class="org-keyword">def</span> <span class="org-function-name">consume</span>():
    <span class="org-doc">"""Displays a running average across lists of integers sent to it"""</span>
    <span class="org-variable-name">running_sum</span> <span class="org-operator">=</span> 0
    <span class="org-variable-name">data_items_seen</span> <span class="org-operator">=</span> 0

    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-variable-name">data</span> <span class="org-operator">=</span> <span class="org-keyword">yield</span>
        <span class="org-variable-name">data_items_seen</span> <span class="org-operator">+=</span> <span class="org-builtin">len</span>(data)
        <span class="org-variable-name">running_sum</span> <span class="org-operator">+=</span> <span class="org-builtin">sum</span>(data)
        <span class="org-builtin">print</span>(<span class="org-string">'The running average is {}'</span>.<span class="org-builtin">format</span>(running_sum <span class="org-operator">/</span> <span class="org-builtin">float</span>(data_items_seen)))

<span class="org-keyword">def</span> <span class="org-function-name">produce</span>(consumer):
    <span class="org-doc">"""Produces a set of values and forwards them to the pre-defined consumer
    function"""</span>
    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-variable-name">data</span> <span class="org-operator">=</span> get_data()
        <span class="org-builtin">print</span>(<span class="org-string">'Produced {}'</span>.<span class="org-builtin">format</span>(data))
        consumer.send(data)
        <span class="org-keyword">yield</span>

<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">'__main__'</span>:
    <span class="org-variable-name">consumer</span> <span class="org-operator">=</span> consume()
    consumer.send(<span class="org-constant">None</span>)
    <span class="org-variable-name">producer</span> <span class="org-operator">=</span> produce(consumer)

    <span class="org-keyword">for</span> _ <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10):
        <span class="org-builtin">print</span>(<span class="org-string">'Producing...'</span>)
        <span class="org-builtin">next</span>(producer)
</pre>
</div>
</div>
<div id="outline-container-org6ab955e" class="outline-4">
<h4 id="org6ab955e"><span class="section-number-4">2.4.1.</span> 重点</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
在这个文章里面请记得这些重点：
</p>

<ul class="org-ul">
<li><span class="underline">generators</span> 用来产生一系列的值</li>
<li><span class="underline">yield</span> 就像 <span class="underline">generator函数</span> 的 <span class="underline">return</span></li>
<li><span class="underline">yield</span> 唯一的不同就是会保存 <span class="underline">generator函数</span> 的状态</li>
<li><span class="underline">generator</span> 只是一种特殊的 <span class="underline">iterator</span></li>
<li>如同 <span class="underline">iterator</span> ，我们可以通过调用 <span class="underline">next()</span> 获得 <span class="underline">generator</span> 的下一个值
<ul class="org-ul">
<li><span class="underline">for</span> 会隐式的调用 <span class="underline">next()</span></li>
</ul></li>
</ul>


<p>
希望这篇文章能有所助益。如果你从没听说过 <span class="underline">generator</span> ，希望你能够明白他是什么、为什么有用还有如何使用。如果你已经熟悉了 <span class="underline">generator</span> ，希望这篇文章能为你解惑。
老样子，任何部分不清楚的（或者存在错误的），请不吝指教。你可以在下面留言，或者邮件给我jeff@jeffknupp.com， 或者twitter上找我<a href="http://www.twitter.com/jeffknupp">@jeffknupp</a>。
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
目测应该是这个<a href="http://gvr.sourceforge.net/index.php">http://gvr.sourceforge.net/index.php</a>
</p></div></div>


</div>
</div>
